# Introduction to Pandas

In this section of the course we will learn how to use pandas for data analysis. You can think of pandas as an extremely powerful version of Excel, with a lot more features. In this section of the course, you should go through the notebooks in this order:

* Introduction to Pandas
* Series
* DataFrames
* Missing Data
* GroupBy
* Merging,Joining,and Concatenating
* Operations
* Data Input and Output

#### for installation :
#### go to the terminal and type:
#### conda install pandas

# Series

The first main data type we will learn about for pandas is the Series data type. Let's import Pandas and explore the Series object.

A Series is very similar to a NumPy array (in fact it is built on top of the NumPy array object). What differentiates the NumPy array from a Series, is that a Series can have axis labels, meaning it can be indexed by a label, instead of just a number location. It also doesn't need to hold numeric data, it can hold any arbitrary Python Object.

Let's explore this concept through some examples:

In [5]:
import numpy as np
import pandas as pd

### Creating a Series

You can convert a list,numpy array, or dictionary to a Series:

In [6]:
labels = ['a','b','c']
my_list = [10,20,30]

In [7]:
pd.Series(data  = my_list)

0    10
1    20
2    30
dtype: int64

In [8]:
pd.Series(data = my_list, index = labels) # the no of elements in labels must be equalt to data elements

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(my_list , labels)  # same as the above cell

a    10
b    20
c    30
dtype: int64

In [10]:
arr = np.array([10,20,30])
arr

array([10, 20, 30])

In [11]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [12]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int64

In [13]:
d = {'a':10,'b':20,'c':30}
d

{'a': 10, 'b': 20, 'c': 30}

In [14]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

### Data in a Series

A pandas Series can hold a variety of object types:

In [15]:
pd.Series(data = labels)

0    a
1    b
2    c
dtype: object

In [16]:
pd.Series([sum,print,len]) #we can even pass functions in series

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

## Using an Index

The key to using a Series is understanding its index. Pandas makes use of these index names or numbers by allowing for fast look ups of information (works like a hash table or dictionary).

Let's see some examples of how to grab information from a Series. Let us create two sereis, ser1 and ser2:

In [17]:
ser1 = pd.Series([1,2,3,4],index = ['USA', 'Germany','USSR', 'Japan'])

In [18]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [19]:
ser1['Germany']

2

In [20]:
ser2 = pd.Series([1,2,5,4],index = ['USA', 'Germany','Italy', 'Japan'])

In [21]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [22]:
ser2['Japan']

4

Operations are then also done based off of index:

In [23]:
ser1 + ser2 # the values will add as per indexes

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [24]:
ser2 - ser1

Germany    0.0
Italy      NaN
Japan      0.0
USA        0.0
USSR       NaN
dtype: float64

In [25]:
ser1 * ser2

Germany     4.0
Italy       NaN
Japan      16.0
USA         1.0
USSR        NaN
dtype: float64

In [26]:
ser3 = pd.Series(['a', 'b', 'c' ,'d'] , [1,2,3,4])
ser3

1    a
2    b
3    c
4    d
dtype: object

In [27]:
ser4 = pd.Series(['f', 'g', 'h' ,'i'] , [1,2,3,4])
ser4

1    f
2    g
3    h
4    i
dtype: object

In [28]:
ser3 + ser4 #the chars will concatinate

1    af
2    bg
3    ch
4    di
dtype: object

# DataFrames

DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic!

In [29]:
from numpy.random import randn
np.random.seed(101)

In [30]:
df = pd.DataFrame(randn(5,4), index = 'A B C D E' .split(), columns = 'W X Y Z'.split()) #this is getting data from random seed
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

## Selection and Indexing

 various methods to grab data from a DataFrame

In [31]:
df['W'] #pass a column or row name

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [32]:
df[['W', 'Z']] #pass the lsit of rows or columns

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [33]:
df.W #SQL syntax

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

#### DataFrame Columns are just Series

In [34]:
type(df['W']) # every column in the data frame are series

pandas.core.series.Series

**Creating a new column:**

In [950]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [951]:
df['new'] = df['W'] + df['Y']

In [952]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

**removing column**

In [953]:
df.drop('new', axis = 1) # axis = 1 is for columns, for rows axis = 0

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [954]:
df
#the remove operation is not done in the original df unless specified

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [955]:
df.drop('new', axis =1, inplace = True) #in place tell pandas to apply the operation in original df

In [956]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

#### removing rows

In [957]:
df.drop('E' , axis =0 , inplace =True)

In [958]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

#### selecting rows

In [959]:
df.loc['A'] #to get row by name

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [960]:
df.iloc[2] #to get row by index

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [961]:
df['W'] #for column directly pass

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
Name: W, dtype: float64

In [962]:
df.loc['B', 'Y'] #accessing perticular element

-0.8480769834036315

In [963]:
df.loc[['A', 'B'], ['W', 'Y']] #accessing multiple elements

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [964]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [965]:
df['new'] = df['X'] + df['Y']

In [966]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  1.536102
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395
C -2.018168  0.740122  0.528813 -0.589001  1.268936
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109

In [967]:
df > 0 #returns a bool df

       W      X      Y      Z    new
A   True   True   True   True   True
B   True  False  False   True  False
C  False   True   True  False   True
D   True  False  False   True  False

In [968]:
df[df>0] #returns the perticular values where bool df is true

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  1.536102
B  0.651118       NaN       NaN  0.605965       NaN
C       NaN  0.740122  0.528813       NaN  1.268936
D  0.188695       NaN       NaN  0.955057       NaN

In [969]:
df[df['W'] > 0] #returns the elements of that colums where df is true

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  1.536102
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109

In [970]:
df[df['W'] > 0] [['Y', 'X']] #returns in w only x and y part

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872

For two conditions you can use | and & with parenthesis:

In [971]:
df[(df['W'] > 0) & (df['Y'] > 0.5)] #here two conditions are checked and their intersection is returned

         W         X         Y         Z       new
A  2.70685  0.628133  0.907969  0.503826  1.536102

In [972]:
df[(df['W'] > 0.3) | (df['Y'] > 0.5)]

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  1.536102
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395
C -2.018168  0.740122  0.528813 -0.589001  1.268936

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [973]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  1.536102
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395
C -2.018168  0.740122  0.528813 -0.589001  1.268936
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109

In [974]:
df.reset_index() #gets the index of 1,2,3,4...n back

  index         W         X         Y         Z       new
0     A  2.706850  0.628133  0.907969  0.503826  1.536102
1     B  0.651118 -0.319318 -0.848077  0.605965 -1.167395
2     C -2.018168  0.740122  0.528813 -0.589001  1.268936
3     D  0.188695 -0.758872 -0.933237  0.955057 -1.692109

In [975]:
newind = 'CA NY WY OR'.split() #splits the string nd assigns them in order

In [976]:
df['States'] = newind

In [977]:
df

          W         X         Y         Z       new States
A  2.706850  0.628133  0.907969  0.503826  1.536102     CA
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395     NY
C -2.018168  0.740122  0.528813 -0.589001  1.268936     WY
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109     OR

In [978]:
df.set_index('States') #states column is the new index, the original df does not change

               W         X         Y         Z       new
States
CA      2.706850  0.628133  0.907969  0.503826  1.536102
NY      0.651118 -0.319318 -0.848077  0.605965 -1.167395
WY     -2.018168  0.740122  0.528813 -0.589001  1.268936
OR      0.188695 -0.758872 -0.933237  0.955057 -1.692109

In [979]:
df.set_index('States', inplace = True)

In [980]:
df

               W         X         Y         Z       new
States
CA      2.706850  0.628133  0.907969  0.503826  1.536102
NY      0.651118 -0.319318 -0.848077  0.605965 -1.167395
WY     -2.018168  0.740122  0.528813 -0.589001  1.268936
OR      0.188695 -0.758872 -0.933237  0.955057 -1.692109

## Multi-Index and Index Hierarchy

Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

In [981]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [982]:
hier_index #creating groups indide the df

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [983]:
df = pd.DataFrame(np.random.rand(6,2),index = hier_index, columns = ['A', 'B'])
df

             A         B
G1 1  0.734819  0.541962
   2  0.913154  0.807920
   3  0.402998  0.357224
G2 1  0.952877  0.343632
   2  0.865100  0.830278
   3  0.538161  0.922469

In [984]:
df.loc['G1']

          A         B
1  0.734819  0.541962
2  0.913154  0.807920
3  0.402998  0.357224

In [985]:
df.loc['G1'].loc[1]

A    0.734819
B    0.541962
Name: 1, dtype: float64

In [986]:
df.index.names

FrozenList([None, None])

In [987]:
df.index.names = ['Group', 'Num']

In [988]:
df

                  A         B
Group Num
G1    1    0.734819  0.541962
      2    0.913154  0.807920
      3    0.402998  0.357224
G2    1    0.952877  0.343632
      2    0.865100  0.830278
      3    0.538161  0.922469

In [989]:
df.xs('G1') #cross section - returns the required part

            A         B
Num
1    0.734819  0.541962
2    0.913154  0.807920
3    0.402998  0.357224

In [990]:
df.xs(('G1', 1))

A    0.734819
B    0.541962
Name: (G1, 1), dtype: float64

In [991]:
df.xs(1,level ='Num')

              A         B
Group
G1     0.734819  0.541962
G2     0.952877  0.343632

# Missing Data

Let's show a few convenient methods to deal with Missing Data in pandas:

In [992]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [993]:
df #there can be missing datas in teh df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [994]:
df.dropna() #directly removing all the na values , for rows as axis = 0 by default

     A    B  C
0  1.0  5.0  1

In [995]:
df #does not change the original df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [996]:
df.dropna(axis =1) #removes the na vlaues in column

   C
0  1
1  2
2  3

In [997]:
df.dropna(thresh =2) #threshold will remove the row only if there are at least 2 na value

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [998]:
df.fillna(value = 'FILL VALUE') #we can fill values together

            A           B  C
0         1.0         5.0  1
1         2.0  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [999]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [1000]:
df['A'].fillna(value = df['A'].mean()) #filling the value by the mean of values in the column

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# Groupby

The groupby method allows you to group rows of data together and call aggregate functions

In [1001]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [1002]:
df = pd.DataFrame(data)

In [1003]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

** Now you can use the .groupby() method to group rows together based off of a column name. For instance let's group based off of Company. This will create a DataFrameGroupBy object:**

In [1004]:
df.groupby(['Company'])

You can save this object as a new variable:

In [1005]:
by_comp = df.groupby('Company')

And then call aggregate methods off the object:

In [1006]:
by_comp.min() #arrange in ascending order the company column

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [1007]:
by_comp.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [1008]:
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [1009]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [1010]:
by_comp.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [1011]:
by_comp.describe().transpose()['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

In [1012]:
table = {'Flavor':['Mint Choco Chip','Chocolate','Cookie Dough','Pistachio','Cake Batter','Neapolitian','Fudge brownie','Rocie Road','Latte'],
       'Base Flavor':['Vanilla', 'Chocolate', 'Vanilla', 'Vanilla', 'Vanilla' , 'Vanilla' , 'Chocolate', 'Vanilla', 'Vanilla'],
       'Liked':['yes', 'yes', 'no', 'no', 'no', 'yes', 'yes','no','no'],
        'Flovor Rating': [10,8,9,7,10,4,7,8,9],
        'Texture Rating':[8,7,5,6,7,3,6,5,7],
        'Total Rating': [18.0, 16.6, 9.7,13.4,15.2,5.7,12.5,8.8,15.3]}

In [1013]:
table

{'Flavor': ['Mint Choco Chip',
  'Chocolate',
  'Cookie Dough',
  'Pistachio',
  'Cake Batter',
  'Neapolitian',
  'Fudge brownie',
  'Rocie Road',
  'Latte'],
 'Base Flavor': ['Vanilla',
  'Chocolate',
  'Vanilla',
  'Vanilla',
  'Vanilla',
  'Vanilla',
  'Chocolate',
  'Vanilla',
  'Vanilla'],
 'Liked': ['yes', 'yes', 'no', 'no', 'no', 'yes', 'yes', 'no', 'no'],
 'Flovor Rating': [10, 8, 9, 7, 10, 4, 7, 8, 9],
 'Texture Rating': [8, 7, 5, 6, 7, 3, 6, 5, 7],
 'Total Rating': [18.0, 16.6, 9.7, 13.4, 15.2, 5.7, 12.5, 8.8, 15.3]}

In [1014]:
df = pd.DataFrame(table)

In [1015]:
df

,Flavor,Base Flavor,Liked,Flovor Rating,Texture Rating,Total Rating
0,Mint Choco Chip,Vanilla,yes,10,8,18.0
1,Chocolate,Chocolate,yes,8,7,16.6
2,Cookie Dough,Vanilla,no,9,5,9.7
3,Pistachio,Vanilla,no,7,6,13.4
4,Cake Batter,Vanilla,no,10,7,15.2
5,Neapolitian,Vanilla,yes,4,3,5.7
6,Fudge brownie,Chocolate,yes,7,6,12.5
7,Rocie Road,Vanilla,no,8,5,8.8
8,Latte,Vanilla,no,9,7,15.3

In [1016]:
group = df.groupby('Base Flavor')

In [1017]:
group

In [1018]:
group.max()

                    Flavor Liked  Flovor Rating  Texture Rating  Total Rating
Base Flavor
Chocolate    Fudge brownie   yes              8               7          16.6
Vanilla         Rocie Road   yes             10               8          18.0

In [1019]:
group.min()

                  Flavor Liked  Flovor Rating  Texture Rating  Total Rating
Base Flavor
Chocolate      Chocolate   yes              7               6          12.5
Vanilla      Cake Batter    no              4               3           5.7

In [1020]:
group.count()

             Flavor  Liked  Flovor Rating  Texture Rating  Total Rating
Base Flavor
Chocolate         2      2              2               2             2
Vanilla           7      7              7               7             7

In [1021]:
group.describe()

            Flovor Rating                                                  \
                    count      mean       std  min   25%  50%   75%   max
Base Flavor
Chocolate             2.0  7.500000  0.707107  7.0  7.25  7.5  7.75   8.0
Vanilla               7.0  8.142857  2.115701  4.0  7.50  9.0  9.50  10.0

            Texture Rating            ...            Total Rating         \
                     count      mean  ...   75%  max        count   mean
Base Flavor                           ...
Chocolate              2.0  6.500000  ...  6.75  7.0          2.0  14.55
Vanilla                7.0  5.857143  ...  7.00  8.0          7.0  12.30


                  std   min     25%    50%     75%   max
Base Flavor
Chocolate    2.899138  12.5  13.525  14.55  15.575  16.6
Vanilla      4.352777   5.7   9.250  13.40  15.250  18.0

[2 rows x 24 columns]

# Merging, Joining, and Concatenating

There are 3 main ways of combining DataFrames together: Merging, Joining and Concatenating. 
____

In [1022]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [1023]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [1024]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [1025]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [1026]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [1027]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

## Concatenation

Concatenation basically glues together DataFrames. Keep in mind that dimensions should match along the axis you are concatenating on. You can use **pd.concat** and pass in a list of DataFrames to concatenate together:

In [1028]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [1029]:
pd.concat([df1,df2,df3], axis =1) #for concating along rows

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [1030]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [1031]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [1032]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

## Merging

The **merge** function allows you to merge DataFrames together using a similar logic as merging SQL Tables together. For example:

In [1033]:
pd.merge(left, right, how = 'inner', on='key') #this is for merging table internally on the same key

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [1034]:
pd.merge(left, right, how = 'outer', on='key') #here inner and outer are same since the keys are all the same

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [1035]:
left2 = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right2 = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [1036]:
left2

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [1037]:
right2

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [1038]:
pd.merge(left2, right2, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [1039]:
pd.merge(left2, right2, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [1040]:
pd.merge(left2, right2, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [1041]:
pd.merge(left2, right2, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

## Joining
Joining is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame.

In [1042]:
left3 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right3 = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [1043]:
left3

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [1044]:
right3

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [1045]:
left3.join(right3)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [1046]:
left3.join(right3, how = 'outer' )

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

# Operations

There are lots of operations with pandas that will be really useful

In [1047]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [1048]:
df.head() #used to check the initial section of the data

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [1049]:
df.head(3)

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi

### Info on Unique Values

In [1050]:
df['col2'].unique() #gives the unique values

array([444, 555, 666])

In [1051]:
df['col2'].nunique() #gives out the number of unique values

3

In [1052]:
df['col2'].value_counts() #gives out the frequency of values

col2
444    2
555    1
666    1
Name: count, dtype: int64

### Selecting Data

In [1053]:
#Select from DataFrame using criteria from multiple columns
newdf = df[(df['col1']>2) & (df['col2']==444)]

In [1054]:
newdf

   col1  col2 col3
3     4   444  xyz

### Applying function

In [1055]:
def times2(x):
    return x*2

In [1056]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [1057]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [1058]:
df['col1'].sum()

10

In [1059]:
del df['col1'] #deleting the column

In [1060]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

##### Get column and index names

In [1062]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [1063]:
df.index

RangeIndex(start=0, stop=4, step=1)

##### Sorting and ordering the dataframe

In [1065]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [1066]:
df.sort_values(by='col2') #inplace = False by default

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

##### find null values or check for null values

In [1068]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [1071]:
#drop rows with nan values
df.dropna()

   col1   col2 col3
1   2.0  555.0  def
2   3.0  666.0  ghi

** Filling in NaN values with something else: **

In [1073]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [1074]:
df.fillna('FILL')

   col1   col2 col3
0   1.0   FILL  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3  FILL  444.0  xyz

In [1079]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [1080]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [1081]:
df.pivot_table(values = 'D', index =['A', 'B'], columns =['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN